#+TITLE: 確率シミュレーション
#+AUTHOR: 村田 昇
#+EMAIL: noboru.murata@eb.waseda.ac.jp
#+DATE: 2020.05.15
:reveal:
# #+INCLUDE: "~/.emacs.d/oer-reveal-org/config-de.org"
#+INCLUDE: "./myconf.org"
#+STARTUP: hidestars content
# C-c C-x C-v でinlineを切り替え
# <l C-i でlatex block
# C-c '
#+OPTIONS: date:t H:4 num:nil toc:nil \n:nil
#+OPTIONS: @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:t 
#+OPTIONS: skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+PROPERTY: header-args:R :session *R* :cache yes 
#+PROPERTY: header-args:R+ :exports both :results output
#+PROPERTY: header-args:R+ :tangle no
#+PROPERTY: header-args:latex :exports results :results raw

#+begin_src R :exports none
  setwd("~/Desktop/lectures/u-tokyo/spring/slide")
#+end_src
#+begin_src R :exports none :tangle yes
  ### 第5回 演習問題解答例
#+end_src
:end:

** テスト
   - てすと
     #+begin_src R :tangle yes
       ## 抽出する行番号のベクトルで指定
       airquality[1:10,] # 1-10行を抽出
     #+end_src

     #+RESULTS:
     |  41 | 190 |  7.4 | 67 | 5 |  1 |
     |  36 | 118 |    8 | 72 | 5 |  2 |
     |  12 | 149 | 12.6 | 74 | 5 |  3 |
     |  18 | 313 | 11.5 | 62 | 5 |  4 |
     | nil | nil | 14.3 | 56 | 5 |  5 |
     |  28 | nil | 14.9 | 66 | 5 |  6 |
     |  23 | 299 |  8.6 | 65 | 5 |  7 |
     |  19 |  99 | 13.8 | 59 | 5 |  8 |
     |   8 |  19 | 20.1 | 61 | 5 |  9 |
     | nil | 194 |  8.6 | 69 | 5 | 10 |

